Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION1" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000103C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001040"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK2" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION2" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000104C"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="COMP3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0001050"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="MASK3" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0xE0001054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="FUNCTION3" edc:nzwidth="0x20" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:impl="0x10FFFAF" edc:_addr="0xE0001058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xCFA8" edc:_addr="0xE000105C"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="ICTR" edc:impl="0xF" edc:access="----------------------------rrrr" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Interrupt Controller Type Register" edc:_addr="0xE000E004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:nzwidth="0x4" edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SystemControl" edc:cname="ACTLR" edc:nzwidth="0x20" edc:access="----------------------nn-----nnn" edc:impl="0x307" edc:_addr="0xE000E008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="DISMCYCINT" edc:nzwidth="0x1" edc:desc="Disable interruption of LDM/STM instructions"/>
            <edc:SFRFieldDef edc:cname="DISDEFWBUF" edc:nzwidth="0x1" edc:desc="Disable wruite buffer use during default memory map accesses"/>
            <edc:SFRFieldDef edc:cname="DISFOLD" edc:nzwidth="0x1" edc:desc="Disable IT folding"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DISFPCA" edc:nzwidth="0x1" edc:desc="Disable automatic update of CONTROL.FPCA"/>
            <edc:SFRFieldDef edc:cname="DISOOFP" edc:nzwidth="0x1" edc:desc="Disable out-of-order FP instructions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000E00C"/>
      <edc:SFRDef ltx:memberofperipheral="SysTick" edc:cname="CSR" edc:nzwidth="0x20" edc:access="---------------n-------------nnn" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:impl="0x10007" edc:_addr="0xE000E010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SysTick Counter Enable">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counter disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counter enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:nzwidth="0x1" edc:desc="SysTick Exception Request Enable">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counting down to 0 does not assert the SysTick exception request" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counting down to 0 asserts the SysTick exception request" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:nzwidth="0x1" edc:desc="Clock Source 0=external, 1=processor">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="External clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Processor clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:nzwidth="0x1" edc:desc="Timer counted to 0 since last read of register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
