Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSB" edc:nzwidth="0x8" edc:access="-rrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x41002002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PROT" edc:nzwidth="0x1" edc:desc="Protected"/>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:nzwidth="0x1" edc:desc="Debugger Present"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 1 Dirty"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:nzwidth="0x1" edc:desc="Hot-Plugging Enable"/>
            <edc:SFRFieldDef edc:cname="CELCK" edc:nzwidth="0x1" edc:desc="Chip Erase Locked"/>
            <edc:SFRFieldDef edc:cname="CEHL" edc:nzwidth="0x1" edc:desc="Chip Erase Hard Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x41002003"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:nzwidth="0x2" edc:desc="Access Mode"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="LENGTH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFC" edc:_addr="0x41002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:nzwidth="0x1E" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DID" edc:nzwidth="0x20" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:por="01100001100000100000010000000001" edc:mclr="01100001100000100000010000000001" edc:impl="0xFFBFFFFF" edc:_addr="0x41002018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:nzwidth="0x8" edc:desc="Device Select">
              <edc:SFRFieldSemantic edc:cname="1MB_256KB_128PIN" edc:desc="1 MB Flash / 256 KB SRAM / 128-pin" edc:when="(field &amp; 0xFF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1MB_256KB_100PIN" edc:desc="1 MB Flash / 256 KB SRAM / 100-pin" edc:when="(field &amp; 0xFF) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x4" edc:desc="Die Number"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:nzwidth="0x6" edc:desc="Series">
              <edc:SFRFieldSemantic edc:cname="PIC32CX_SG60" edc:desc="PIC32CX SG Without Immutable Boot, With HSM" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PIC32CX_SG61" edc:desc="PIC32CX SG With Immutable Boot and HSM" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PIC32CX_SG41" edc:desc="PIC32CX SG With Immutable Boot, No HSM" edc:when="(field &amp; 0x3F) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:nzwidth="0x5" edc:desc="Family">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="PIC32CX Advanced Feature Set Microcontrollers" edc:when="(field &amp; 0x1F) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:nzwidth="0x4" edc:desc="Processor">
              <edc:SFRFieldSemantic edc:cname="CM4F" edc:desc="Cortex-M4 with FPU" edc:when="(field &amp; 0xF) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CFG" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x1F" edc:_addr="0x4100201C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="LQOS" edc:nzwidth="0x2" edc:desc="Latency Quality Of Service"/>
            <edc:SFRFieldDef edc:cname="DCCDMALEVEL" edc:nzwidth="0x2" edc:desc="DMA Trigger Level">
              <edc:SFRFieldSemantic edc:cname="EMPTY" edc:desc="Trigger rises when DCC is empty" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Trigger rises when DCC is full" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ETBRAMEN" edc:nzwidth="0x1" edc:desc="Trace Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
