Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="-----nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x41004010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Command Done"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:nzwidth="0x1" edc:desc="Address Error"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:nzwidth="0x1" edc:desc="Programming Error"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:nzwidth="0x1" edc:desc="Lock Error"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:nzwidth="0x1" edc:desc="ECC Single Error"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:nzwidth="0x1" edc:desc="ECC Dual Error"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:nzwidth="0x1" edc:desc="NVM Error"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Suspended Write Or Erase Operation"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:nzwidth="0x1" edc:desc="Active SEES Full"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:nzwidth="0x1" edc:desc="Active SEES Overflow"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:nzwidth="0x1" edc:desc="SEE Write Completed"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="--rrrrrr--rrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3F3F" edc:_addr="0x41004012">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:nzwidth="0x1" edc:desc="Ready to accept a command"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:nzwidth="0x1" edc:desc="Power Reduction Mode"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:nzwidth="0x1" edc:desc="NVM Page Buffer Active Loading"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="NVM Write Or Erase Operation Is Suspended"/>
            <edc:SFRFieldDef edc:cname="AFIRST" edc:nzwidth="0x1" edc:desc="BANKA First"/>
            <edc:SFRFieldDef edc:cname="BPDIS" edc:nzwidth="0x1" edc:desc="Boot Loader Protection Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTPROT" edc:nzwidth="0x4" edc:desc="Boot Loader Protection Size">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="0 kbytes" edc:when="(field &amp; 0xF) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 kbytes" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 kbytes" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="40" edc:desc="40 kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="48" edc:desc="48 kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="56" edc:desc="56 kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="72" edc:desc="72 kbytes" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="80" edc:desc="80 kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="88" edc:desc="88 kbytes" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="96" edc:desc="96 kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="104" edc:desc="104 kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="112" edc:desc="112 kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="120" edc:desc="120 kbytes" edc:when="(field &amp; 0xF) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBPE" edc:nzwidth="0x1" edc:desc="Dual Boot Protection Enable"/>
            <edc:SFRFieldDef edc:cname="BPHL" edc:nzwidth="0x1" edc:desc="Boot Protect Hard Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x41004014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x18" edc:desc="NVM Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="RUNLOCK" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="RUNLOCK" edc:nzwidth="0x20" edc:desc="Region Un-Lock Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PBLDATA0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:_addr="0x4100401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Page Buffer Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="PBLDATA1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:_addr="0x41004020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Page Buffer Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
