Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="RXESC" edc:nzwidth="0x20" edc:access="---------------------nnn-nnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x777" edc:_addr="0x420000BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="F0DS" edc:nzwidth="0x3" edc:desc="Rx FIFO 0 Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1DS" edc:nzwidth="0x3" edc:desc="Rx FIFO 1 Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RBDS" edc:nzwidth="0x3" edc:desc="Rx Buffer Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBC" edc:nzwidth="0x20" edc:access="-nnnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F3FFFFF" edc:_addr="0x420000C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TBSA" edc:nzwidth="0x10" edc:desc="Tx Buffers Start Address"/>
            <edc:SFRFieldDef edc:cname="NDTB" edc:nzwidth="0x6" edc:desc="Number of Dedicated Transmit Buffers"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFQS" edc:nzwidth="0x6" edc:desc="Transmit FIFO/Queue Size"/>
            <edc:SFRFieldDef edc:cname="TFQM" edc:nzwidth="0x1" edc:desc="Tx FIFO/Queue Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXFQS" edc:nzwidth="0x20" edc:access="----------rrrrrr---rrrrr--rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F1F3F" edc:_addr="0x420000C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TFFL" edc:nzwidth="0x6" edc:desc="Tx FIFO Free Level"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFGI" edc:nzwidth="0x5" edc:desc="Tx FIFO Get Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TFQPI" edc:nzwidth="0x5" edc:desc="Tx FIFO/Queue Put Index"/>
            <edc:SFRFieldDef edc:cname="TFQF" edc:nzwidth="0x1" edc:desc="Tx FIFO/Queue Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXESC" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x420000C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TBDS" edc:nzwidth="0x3" edc:desc="Tx Buffer Data Field Size">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
