Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x420000E8"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXEFC" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3FFFFF" edc:_addr="0x420000F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFSA" edc:nzwidth="0x10" edc:desc="Event FIFO Start Address"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:nzwidth="0x6" edc:desc="Event FIFO Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:nzwidth="0x6" edc:desc="Event FIFO Watermark"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXEFS" edc:nzwidth="0x20" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x31F1F3F" edc:_addr="0x420000F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFFL" edc:nzwidth="0x6" edc:desc="Event FIFO Fill Level"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:nzwidth="0x5" edc:desc="Event FIFO Get Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:nzwidth="0x5" edc:desc="Event FIFO Put Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:nzwidth="0x1" edc:desc="Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXEFA" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x420000F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EFAI" edc:nzwidth="0x5" edc:desc="Event FIFO Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x304" edc:_addr="0x420000FC"/>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="CREL" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrr--------------------" edc:por="00110010000100000000000000000000" edc:mclr="00110010000100000000000000000000" edc:impl="0xFFF00000" edc:_addr="0x42000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:nzwidth="0x4" edc:desc="Sub-step of Core Release"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:nzwidth="0x4" edc:desc="Step of Core Release"/>
            <edc:SFRFieldDef edc:cname="REL" edc:nzwidth="0x4" edc:desc="Core Release"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="ENDN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="10000111011001010100001100100001" edc:mclr="10000111011001010100001100100001" edc:_addr="0x42000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ETV" edc:nzwidth="0x20" edc:desc="Endianness Test Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="MRCFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x3" edc:_addr="0x42000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="QOS" edc:nzwidth="0x2" edc:desc="Quality of Service">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="DBTP" edc:nzwidth="0x20" edc:access="--------n--nnnnn---nnnnnnnnnnnnn" edc:por="00000000000000000000101000110011" edc:mclr="00000000000000000000101000110011" edc:impl="0x9F1FFF" edc:_addr="0x4200040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="DSJW" edc:nzwidth="0x4" edc:desc="Data (Re)Synchronization Jump Width"/>
            <edc:SFRFieldDef edc:cname="DTSEG2" edc:nzwidth="0x4" edc:desc="Data time segment after sample point"/>
            <edc:SFRFieldDef edc:cname="DTSEG1" edc:nzwidth="0x5" edc:desc="Data time segment before sample point"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBRP" edc:nzwidth="0x5" edc:desc="Data Baud Rate Prescaler"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDC" edc:nzwidth="0x1" edc:desc="Tranceiver Delay Compensation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TEST" edc:nzwidth="0x20" edc:access="------------------------nnnn----" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0" edc:_addr="0x42000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LBCK" edc:nzwidth="0x1" edc:desc="Loop Back Mode"/>
            <edc:SFRFieldDef edc:cname="TX" edc:nzwidth="0x2" edc:desc="Control of Transmit Pin">
              <edc:SFRFieldSemantic edc:cname="CORE" edc:desc="TX controlled by CAN core" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="TX monitoring sample point" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DOMINANT" edc:desc="Dominant (0) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RECESSIVE" edc:desc="Recessive (1) level at pin CAN_TX" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RX" edc:nzwidth="0x1" edc:desc="Receive Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RWD" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="WDC" edc:nzwidth="0x8" edc:desc="Watchdog Configuration"/>
            <edc:SFRFieldDef edc:cname="WDV" edc:nzwidth="0x8" edc:desc="Watchdog Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="CCCR" edc:nzwidth="0x20" edc:access="-----------------nnn--nnnnnnnnnn" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:impl="0x73FF" edc:_addr="0x42000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="INIT" edc:nzwidth="0x1" edc:desc="Initialization"/>
            <edc:SFRFieldDef edc:cname="CCE" edc:nzwidth="0x1" edc:desc="Configuration Change Enable"/>
            <edc:SFRFieldDef edc:cname="ASM" edc:nzwidth="0x1" edc:desc="ASM Restricted Operation Mode"/>
            <edc:SFRFieldDef edc:cname="CSA" edc:nzwidth="0x1" edc:desc="Clock Stop Acknowledge"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Clock Stop Request"/>
            <edc:SFRFieldDef edc:cname="MON" edc:nzwidth="0x1" edc:desc="Bus Monitoring Mode"/>
            <edc:SFRFieldDef edc:cname="DAR" edc:nzwidth="0x1" edc:desc="Disable Automatic Retransmission"/>
            <edc:SFRFieldDef edc:cname="TEST" edc:nzwidth="0x1" edc:desc="Test Mode Enable"/>
            <edc:SFRFieldDef edc:cname="FDOE" edc:nzwidth="0x1" edc:desc="FD Operation Enable"/>
            <edc:SFRFieldDef edc:cname="BRSE" edc:nzwidth="0x1" edc:desc="Bit Rate Switch Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PXHD" edc:nzwidth="0x1" edc:desc="Protocol Exception Handling Disable"/>
            <edc:SFRFieldDef edc:cname="EFBI" edc:nzwidth="0x1" edc:desc="Edge Filtering during Bus Integration"/>
            <edc:SFRFieldDef edc:cname="TXP" edc:nzwidth="0x1" edc:desc="Transmit Pause"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="NBTP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:por="00000110000000000000101000000011" edc:mclr="00000110000000000000101000000011" edc:impl="0xFFFFFF7F" edc:_addr="0x4200041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="NTSEG2" edc:nzwidth="0x7" edc:desc="Nominal Time segment after sample point"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NTSEG1" edc:nzwidth="0x8" edc:desc="Nominal Time segment before sample point"/>
            <edc:SFRFieldDef edc:cname="NBRP" edc:nzwidth="0x9" edc:desc="Nominal Baud Rate Prescaler"/>
            <edc:SFRFieldDef edc:cname="NSJW" edc:nzwidth="0x7" edc:desc="Nominal (Re)Synchronization Jump Width"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TSCC" edc:nzwidth="0x20" edc:access="------------nnnn--------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0003" edc:_addr="0x42000420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TSS" edc:nzwidth="0x2" edc:desc="Timestamp Select">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Timestamp counter value always 0x0000" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Timestamp counter value incremented by TCP" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="TCP" edc:nzwidth="0x4" edc:desc="Timestamp Counter Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
