Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42000458">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Timestamp Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BECL" edc:nzwidth="0x1" edc:desc="Bit Error Corrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BEUL" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x4200045C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x42000460"/>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="GFC" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x42000480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RRFE" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Extended"/>
            <edc:SFRFieldDef edc:cname="RRFS" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Standard"/>
            <edc:SFRFieldDef edc:cname="ANFE" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Extended">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Standard">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="SIDFC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42000484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="FLSSA" edc:nzwidth="0x10" edc:desc="Filter List Standard Start Address"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:nzwidth="0x8" edc:desc="List Size Standard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="XIDFC" edc:nzwidth="0x20" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFF" edc:_addr="0x42000488">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="FLESA" edc:nzwidth="0x10" edc:desc="Filter List Extended Start Address"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:nzwidth="0x7" edc:desc="List Size Extended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4200048C"/>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="XIDAM" edc:nzwidth="0x20" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00011111111111111111111111111111" edc:mclr="00011111111111111111111111111111" edc:impl="0x1FFFFFFF" edc:_addr="0x42000490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EIDM" edc:nzwidth="0x1D" edc:desc="Extended ID Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
