Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="CR0" edc:nzwidth="0x1" edc:desc="Cancellation Request 0"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:nzwidth="0x1" edc:desc="Cancellation Request 1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:nzwidth="0x1" edc:desc="Cancellation Request 2"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:nzwidth="0x1" edc:desc="Cancellation Request 3"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:nzwidth="0x1" edc:desc="Cancellation Request 4"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:nzwidth="0x1" edc:desc="Cancellation Request 5"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:nzwidth="0x1" edc:desc="Cancellation Request 6"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:nzwidth="0x1" edc:desc="Cancellation Request 7"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:nzwidth="0x1" edc:desc="Cancellation Request 8"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:nzwidth="0x1" edc:desc="Cancellation Request 9"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:nzwidth="0x1" edc:desc="Cancellation Request 10"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:nzwidth="0x1" edc:desc="Cancellation Request 11"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:nzwidth="0x1" edc:desc="Cancellation Request 12"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:nzwidth="0x1" edc:desc="Cancellation Request 13"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:nzwidth="0x1" edc:desc="Cancellation Request 14"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:nzwidth="0x1" edc:desc="Cancellation Request 15"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:nzwidth="0x1" edc:desc="Cancellation Request 16"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:nzwidth="0x1" edc:desc="Cancellation Request 17"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:nzwidth="0x1" edc:desc="Cancellation Request 18"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:nzwidth="0x1" edc:desc="Cancellation Request 19"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:nzwidth="0x1" edc:desc="Cancellation Request 20"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:nzwidth="0x1" edc:desc="Cancellation Request 21"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:nzwidth="0x1" edc:desc="Cancellation Request 22"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:nzwidth="0x1" edc:desc="Cancellation Request 23"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:nzwidth="0x1" edc:desc="Cancellation Request 24"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:nzwidth="0x1" edc:desc="Cancellation Request 25"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:nzwidth="0x1" edc:desc="Cancellation Request 26"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:nzwidth="0x1" edc:desc="Cancellation Request 27"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:nzwidth="0x1" edc:desc="Cancellation Request 28"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:nzwidth="0x1" edc:desc="Cancellation Request 29"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:nzwidth="0x1" edc:desc="Cancellation Request 30"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:nzwidth="0x1" edc:desc="Cancellation Request 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBTO" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TO0" edc:nzwidth="0x1" edc:desc="Transmission Occurred 0"/>
            <edc:SFRFieldDef edc:cname="TO1" edc:nzwidth="0x1" edc:desc="Transmission Occurred 1"/>
            <edc:SFRFieldDef edc:cname="TO2" edc:nzwidth="0x1" edc:desc="Transmission Occurred 2"/>
            <edc:SFRFieldDef edc:cname="TO3" edc:nzwidth="0x1" edc:desc="Transmission Occurred 3"/>
            <edc:SFRFieldDef edc:cname="TO4" edc:nzwidth="0x1" edc:desc="Transmission Occurred 4"/>
            <edc:SFRFieldDef edc:cname="TO5" edc:nzwidth="0x1" edc:desc="Transmission Occurred 5"/>
            <edc:SFRFieldDef edc:cname="TO6" edc:nzwidth="0x1" edc:desc="Transmission Occurred 6"/>
            <edc:SFRFieldDef edc:cname="TO7" edc:nzwidth="0x1" edc:desc="Transmission Occurred 7"/>
            <edc:SFRFieldDef edc:cname="TO8" edc:nzwidth="0x1" edc:desc="Transmission Occurred 8"/>
            <edc:SFRFieldDef edc:cname="TO9" edc:nzwidth="0x1" edc:desc="Transmission Occurred 9"/>
            <edc:SFRFieldDef edc:cname="TO10" edc:nzwidth="0x1" edc:desc="Transmission Occurred 10"/>
            <edc:SFRFieldDef edc:cname="TO11" edc:nzwidth="0x1" edc:desc="Transmission Occurred 11"/>
            <edc:SFRFieldDef edc:cname="TO12" edc:nzwidth="0x1" edc:desc="Transmission Occurred 12"/>
            <edc:SFRFieldDef edc:cname="TO13" edc:nzwidth="0x1" edc:desc="Transmission Occurred 13"/>
            <edc:SFRFieldDef edc:cname="TO14" edc:nzwidth="0x1" edc:desc="Transmission Occurred 14"/>
            <edc:SFRFieldDef edc:cname="TO15" edc:nzwidth="0x1" edc:desc="Transmission Occurred 15"/>
            <edc:SFRFieldDef edc:cname="TO16" edc:nzwidth="0x1" edc:desc="Transmission Occurred 16"/>
            <edc:SFRFieldDef edc:cname="TO17" edc:nzwidth="0x1" edc:desc="Transmission Occurred 17"/>
            <edc:SFRFieldDef edc:cname="TO18" edc:nzwidth="0x1" edc:desc="Transmission Occurred 18"/>
            <edc:SFRFieldDef edc:cname="TO19" edc:nzwidth="0x1" edc:desc="Transmission Occurred 19"/>
            <edc:SFRFieldDef edc:cname="TO20" edc:nzwidth="0x1" edc:desc="Transmission Occurred 20"/>
            <edc:SFRFieldDef edc:cname="TO21" edc:nzwidth="0x1" edc:desc="Transmission Occurred 21"/>
            <edc:SFRFieldDef edc:cname="TO22" edc:nzwidth="0x1" edc:desc="Transmission Occurred 22"/>
            <edc:SFRFieldDef edc:cname="TO23" edc:nzwidth="0x1" edc:desc="Transmission Occurred 23"/>
            <edc:SFRFieldDef edc:cname="TO24" edc:nzwidth="0x1" edc:desc="Transmission Occurred 24"/>
            <edc:SFRFieldDef edc:cname="TO25" edc:nzwidth="0x1" edc:desc="Transmission Occurred 25"/>
            <edc:SFRFieldDef edc:cname="TO26" edc:nzwidth="0x1" edc:desc="Transmission Occurred 26"/>
            <edc:SFRFieldDef edc:cname="TO27" edc:nzwidth="0x1" edc:desc="Transmission Occurred 27"/>
            <edc:SFRFieldDef edc:cname="TO28" edc:nzwidth="0x1" edc:desc="Transmission Occurred 28"/>
            <edc:SFRFieldDef edc:cname="TO29" edc:nzwidth="0x1" edc:desc="Transmission Occurred 29"/>
            <edc:SFRFieldDef edc:cname="TO30" edc:nzwidth="0x1" edc:desc="Transmission Occurred 30"/>
            <edc:SFRFieldDef edc:cname="TO31" edc:nzwidth="0x1" edc:desc="Transmission Occurred 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBCF" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="CF0" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 0"/>
            <edc:SFRFieldDef edc:cname="CF1" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 1"/>
            <edc:SFRFieldDef edc:cname="CF2" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 2"/>
            <edc:SFRFieldDef edc:cname="CF3" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 3"/>
            <edc:SFRFieldDef edc:cname="CF4" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 4"/>
            <edc:SFRFieldDef edc:cname="CF5" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 5"/>
            <edc:SFRFieldDef edc:cname="CF6" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 6"/>
            <edc:SFRFieldDef edc:cname="CF7" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 7"/>
            <edc:SFRFieldDef edc:cname="CF8" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 8"/>
            <edc:SFRFieldDef edc:cname="CF9" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 9"/>
            <edc:SFRFieldDef edc:cname="CF10" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 10"/>
            <edc:SFRFieldDef edc:cname="CF11" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 11"/>
            <edc:SFRFieldDef edc:cname="CF12" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 12"/>
            <edc:SFRFieldDef edc:cname="CF13" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 13"/>
            <edc:SFRFieldDef edc:cname="CF14" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 14"/>
            <edc:SFRFieldDef edc:cname="CF15" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 15"/>
            <edc:SFRFieldDef edc:cname="CF16" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 16"/>
            <edc:SFRFieldDef edc:cname="CF17" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 17"/>
            <edc:SFRFieldDef edc:cname="CF18" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 18"/>
            <edc:SFRFieldDef edc:cname="CF19" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 19"/>
            <edc:SFRFieldDef edc:cname="CF20" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 20"/>
            <edc:SFRFieldDef edc:cname="CF21" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 21"/>
            <edc:SFRFieldDef edc:cname="CF22" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 22"/>
            <edc:SFRFieldDef edc:cname="CF23" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 23"/>
            <edc:SFRFieldDef edc:cname="CF24" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 24"/>
            <edc:SFRFieldDef edc:cname="CF25" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 25"/>
            <edc:SFRFieldDef edc:cname="CF26" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 26"/>
            <edc:SFRFieldDef edc:cname="CF27" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 27"/>
            <edc:SFRFieldDef edc:cname="CF28" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 28"/>
            <edc:SFRFieldDef edc:cname="CF29" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 29"/>
            <edc:SFRFieldDef edc:cname="CF30" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 30"/>
            <edc:SFRFieldDef edc:cname="CF31" edc:nzwidth="0x1" edc:desc="Tx Buffer Cancellation Finished 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
