Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:AdjustPoint edc:offset="0x1FFD318" edc:_addr="0x43002CE8"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="SSAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ARG2" edc:nzwidth="0x20" edc:desc="Argument 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="BSR" edc:nzwidth="0x10" edc:access="-nnn--nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x73FF" edc:_addr="0x45000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BLOCKSIZE" edc:nzwidth="0xA" edc:desc="Transfer Block Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOUNDARY" edc:nzwidth="0x3" edc:desc="SDMA Buffer Boundary">
              <edc:SFRFieldSemantic edc:cname="4K" edc:desc="4k bytes" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8K" edc:desc="8k bytes" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="16K" edc:desc="16k bytes" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="32K" edc:desc="32k bytes" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="64K" edc:desc="64k bytes" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="128K" edc:desc="128k bytes" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="256K" edc:desc="256k bytes" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="512K" edc:desc="512k bytes" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="BCR" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x45000006">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BCNT" edc:nzwidth="0x10" edc:desc="Blocks Count for Current Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="ARG1R" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ARG" edc:nzwidth="0x20" edc:desc="Argument 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="TMR" edc:nzwidth="0x10" edc:access="----------nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3F" edc:_addr="0x4500000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No data transfer or Non DMA data transfer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="DMA data transfer" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCEN" edc:nzwidth="0x1" edc:desc="Block Count Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEN" edc:nzwidth="0x2" edc:desc="Auto Command Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Auto Command Disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CMD12" edc:desc="Auto CMD12 Enable" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CMD23" edc:desc="Auto CMD23 Enable" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTDSEL" edc:nzwidth="0x1" edc:desc="Data Transfer Direction Selection">
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write (Host to Card)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read (Card to Host)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBSEL" edc:nzwidth="0x1" edc:desc="Multi/Single Block Selection">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Block" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="Multiple Block" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="CR" edc:nzwidth="0x10" edc:access="--nnnnnnnnnnn-nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FFB" edc:_addr="0x4500000E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="RESPTYP" edc:nzwidth="0x2" edc:desc="Response Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No response" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="136_BIT" edc:desc="136-bit response" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="48_BIT" edc:desc="48-bit response" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="48_BIT_BUSY" edc:desc="48-bit response check busy after response" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMDCCEN" edc:nzwidth="0x1" edc:desc="Command CRC Check Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDICEN" edc:nzwidth="0x1" edc:desc="Command Index Check Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPSEL" edc:nzwidth="0x1" edc:desc="Data Present Select">
              <edc:SFRFieldSemantic edc:cname="NO_DATA" edc:desc="No Data Present" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA" edc:desc="Data Present" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDTYP" edc:nzwidth="0x2" edc:desc="Command Type">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Other commands" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="CMD52 for writing Bus Suspend in CCCR" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="CMD52 for writing Function Select in CCCR" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ABORT" edc:desc="CMD12, CMD52 for writing I/O Abort in CCCR" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x6" edc:desc="Command Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC0" edc:cname="RR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x45000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CMDRESP" edc:nzwidth="0x20" edc:desc="Command Response"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
