Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="NISTR" edc:nzwidth="0x10" edc:access="nn-----nnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC1FF" edc:_addr="0x46000030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDC" edc:nzwidth="0x1" edc:desc="Command Complete">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No command complete" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Command complete" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRFC" edc:nzwidth="0x1" edc:desc="Transfer Complete">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not complete" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Command execution is completed" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLKGE" edc:nzwidth="0x1" edc:desc="Block Gap Event">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Block Gap Event" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Transaction stopped at block gap" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAINT" edc:nzwidth="0x1" edc:desc="DMA Interrupt">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No DMA Interrupt" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="DMA Interrupt is generated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BWRRDY" edc:nzwidth="0x1" edc:desc="Buffer Write Ready">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not ready to write buffer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Ready to write buffer" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRDRDY" edc:nzwidth="0x1" edc:desc="Buffer Read Ready">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not ready to read buffer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Ready to read buffer" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINS" edc:nzwidth="0x1" edc:desc="Card Insertion">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Card state stable or Debouncing" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card inserted" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CREM" edc:nzwidth="0x1" edc:desc="Card Removal">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Card state stable or Debouncing" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card Removed" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINT" edc:nzwidth="0x1" edc:desc="Card Interrupt">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Card Interrupt" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Generate Card Interrupt" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BOOTAR" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Received"/>
            <edc:SFRFieldDef edc:cname="ERRINT" edc:nzwidth="0x1" edc:desc="Error Interrupt">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="EISTR" edc:nzwidth="0x10" edc:access="---n--nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x13FF" edc:_addr="0x46000032">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:nzwidth="0x1" edc:desc="Command Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Timeout" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:nzwidth="0x1" edc:desc="Command CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="CRC Error Generated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:nzwidth="0x1" edc:desc="Command End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="End Bit Error Generated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:nzwidth="0x1" edc:desc="Command Index Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:nzwidth="0x1" edc:desc="Data Timeout Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Timeout" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:nzwidth="0x1" edc:desc="Data CRC Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:nzwidth="0x1" edc:desc="Data End Bit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:nzwidth="0x1" edc:desc="Current Limit Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Power Fail" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:nzwidth="0x1" edc:desc="Auto CMD Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:nzwidth="0x1" edc:desc="ADMA Error">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Error">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="FIFO contains at least one byte" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="FIFO is empty" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="NISTER" edc:nzwidth="0x10" edc:access="-n-----nnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x41FF" edc:_addr="0x46000034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDC" edc:nzwidth="0x1" edc:desc="Command Complete Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRFC" edc:nzwidth="0x1" edc:desc="Transfer Complete Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLKGE" edc:nzwidth="0x1" edc:desc="Block Gap Event Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAINT" edc:nzwidth="0x1" edc:desc="DMA Interrupt Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BWRRDY" edc:nzwidth="0x1" edc:desc="Buffer Write Ready Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRDRDY" edc:nzwidth="0x1" edc:desc="Buffer Read Ready Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINS" edc:nzwidth="0x1" edc:desc="Card Insertion Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CREM" edc:nzwidth="0x1" edc:desc="Card Removal Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINT" edc:nzwidth="0x1" edc:desc="Card Interrupt Status Enable">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BOOTAR" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Received Status Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
