Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4600005C"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR0" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR1" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000062">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR2" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR3" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000066">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR4" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x46000068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR5" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR6" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="PVR7" edc:nzwidth="0x10" edc:access="nn---nnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xC7FF" edc:_addr="0x4600006E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:nzwidth="0xA" edc:desc="SDCLK Frequency Select Value for Initialization"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:nzwidth="0x1" edc:desc="Clock Generator Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:nzwidth="0x2" edc:desc="Driver Strength Select Value for Initialization">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x46000070"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="SISR" edc:nzwidth="0x10" edc:access="---------------r" edc:por="100000000000000000" edc:mclr="100000000000000000" edc:impl="0x1" edc:_addr="0x460000FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="INTSSL" edc:nzwidth="0x1" edc:desc="Interrupt Signal for Each Slot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="HCVR" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0001100000000010" edc:mclr="0001100000000010" edc:_addr="0x460000FE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SVER" edc:nzwidth="0x8" edc:desc="Spec Version"/>
            <edc:SFRFieldDef edc:cname="VVER" edc:nzwidth="0x8" edc:desc="Vendor Version"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x104" edc:_addr="0x46000100"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="MC1R" edc:nzwidth="0x8" edc:access="nnnnn-nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFB" edc:_addr="0x46000204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTYP" edc:nzwidth="0x2" edc:desc="e.MMC Command Type">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Not a MMC specific command" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="WAITIRQ" edc:desc="Wait IRQ Command" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STREAM" edc:desc="Stream Command" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOOT" edc:desc="Boot Command" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DDR" edc:nzwidth="0x1" edc:desc="e.MMC HSDDR Mode"/>
            <edc:SFRFieldDef edc:cname="OPD" edc:nzwidth="0x1" edc:desc="e.MMC Open Drain Mode"/>
            <edc:SFRFieldDef edc:cname="BOOTA" edc:nzwidth="0x1" edc:desc="e.MMC Boot Acknowledge Enable"/>
            <edc:SFRFieldDef edc:cname="RSTN" edc:nzwidth="0x1" edc:desc="e.MMC Reset Signal"/>
            <edc:SFRFieldDef edc:cname="FCD" edc:nzwidth="0x1" edc:desc="e.MMC Force Card Detect"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="MC2R" edc:nzwidth="0x8" edc:access="------ww" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x46000205">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SRESP" edc:nzwidth="0x1" edc:desc="e.MMC Abort Wait IRQ"/>
            <edc:SFRFieldDef edc:cname="ABOOT" edc:nzwidth="0x1" edc:desc="e.MMC Abort Boot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x46000206"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="ACR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x46000208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="BMAX" edc:nzwidth="0x2" edc:desc="AHB Maximum Burst">
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="CC2R" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x4600020C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="FSDCLKD" edc:nzwidth="0x1" edc:desc="Force SDCK Disabled">
              <edc:SFRFieldSemantic edc:cname="NOEFFECT" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x46000210"/>
      <edc:SFRDef ltx:memberofperipheral="SDHC1" edc:cname="CACR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn-------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF01" edc:_addr="0x46000230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CAPWREN" edc:nzwidth="0x1" edc:desc="Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Key (0x46)">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Key" edc:when="(field &amp; 0xFF) == 0x46"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
