Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLB" edc:nzwidth="0x20" edc:access="--------------n-nnn---n--n---nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x2E247" edc:addr="0x43000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="CHSIZE" edc:nzwidth="0x3" edc:desc="Character Size">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits" edc:when="(field &amp; 0x7) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PLOADEN" edc:nzwidth="0x1" edc:desc="Data Preload Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SSDE" edc:nzwidth="0x1" edc:desc="Slave Select Low Detect Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:nzwidth="0x1" edc:desc="Master Slave Select Enable"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:nzwidth="0x2" edc:desc="Address Mode">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="SPI Address mask " edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_ADDRESSES" edc:desc="Two unique Addressess" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RANGE" edc:desc="Address Range" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLC" edc:nzwidth="0x20" edc:access="-------n------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x100003F" edc:addr="0x43000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="ICSPACE" edc:nzwidth="0x6" edc:desc="Inter-Character Spacing"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:nzwidth="0x1" edc:desc="Data 32 Bit">
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_8BIT" edc:desc="Transaction from and to DATA register are 8-bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_32BIT" edc:desc="Transaction from and to DATA register are 32-bit" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="BAUD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x4300040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="BAUD" edc:nzwidth="0x8" edc:desc="Baud Rate Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0x43000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:nzwidth="0x1" edc:desc="Slave Select Low Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0x43000416">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:nzwidth="0x1" edc:desc="Slave Select Low Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0x43000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:nzwidth="0x1" edc:desc="Slave Select Low Interrupt Flag"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="----n--------n--" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x804" edc:addr="0x4300041A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:nzwidth="0x1" edc:desc="Buffer Overflow"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="LENERR" edc:nzwidth="0x1" edc:desc="Transaction Length Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="---------------------------r-rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x17" edc:addr="0x4300041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SERCOM Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="CTRLB Synchronization Busy"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:nzwidth="0x1" edc:desc="LENGTH Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
