Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG61_DFP/1.0.1/PIC32CX-SG61/edc/PIC32CX1025SG61100.PIC
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CCBUF0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43001830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CCBUF1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x43001834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="USB/DEVICE">
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:por="0000000000000001" edc:mclr="0000000000000001" edc:impl="0xFFF" edc:addr="0x41000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1" edc:desc="Detach"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:nzwidth="0x2" edc:desc="Speed Configuration">
              <edc:SFRFieldSemantic edc:cname="FS" edc:desc="FS : Full Speed" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LS" edc:desc="LS : Low Speed" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HS" edc:desc="HS : High Speed capable" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HSTM" edc:desc="HSTM: High Speed Test Mode (force high-speed mode for test mode)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NREPLY" edc:nzwidth="0x1" edc:desc="No Reply"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:nzwidth="0x1" edc:desc="Test mode J"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:nzwidth="0x1" edc:desc="Test mode K"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:nzwidth="0x1" edc:desc="Test packet mode"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:nzwidth="0x1" edc:desc="Specific Operational Mode"/>
            <edc:SFRFieldDef edc:cname="GNAK" edc:nzwidth="0x1" edc:desc="Global NAK"/>
            <edc:SFRFieldDef edc:cname="LPMHDSK" edc:nzwidth="0x2" edc:desc="Link Power Management Handshake">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No handshake. LPM is not supported" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="ACK" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NYET" edc:desc="NYET" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STALL" edc:desc="STALL" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="DADD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x4100000A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DADD" edc:nzwidth="0x7" edc:desc="Device Address"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1" edc:desc="Device Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="rr--rr--" edc:por="01000000" edc:mclr="01000000" edc:impl="0xCC" edc:addr="0x4100000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Speed Status">
              <edc:SFRFieldSemantic edc:cname="FS" edc:desc="Full-speed mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LS" edc:desc="Low-speed mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HS" edc:desc="High-speed mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINESTATE" edc:nzwidth="0x2" edc:desc="USB Line State Status">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="SE0/RESET" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="FS-J or LS-K State" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="FS-K or LS-J State" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="FNUM" edc:nzwidth="0x10" edc:access="r-rrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xBFFF" edc:addr="0x41000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:nzwidth="0x3" edc:desc="Micro Frame Number"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:nzwidth="0xB" edc:desc="Frame Number"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FNCERR" edc:nzwidth="0x1" edc:desc="Frame Number CRC Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="------nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FF" edc:addr="0x41000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Enable in High Speed Mode"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start Of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:nzwidth="0x1" edc:desc="End Of Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:nzwidth="0x1" edc:desc="Link Power Management Not Yet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:nzwidth="0x1" edc:desc="Link Power Management Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
